thanks @simpson-ross 🙇 that helps clarify things here.

> TF version 1.1.4 and prior exhibit this error

this is expected since terraform < 1.1.5 had an issue (hashicorp/terraform#30330) which incorrectly marked fields as `nullable=false`. it was already addressed in 1.2.x but this fix was backported to 1.1.5 if you must run the 1.x release series. 

```
$ ASDF_TERRAFORM_VERSION=1.1.5 terraform apply
╷
│ Error: Unsupported Terraform Core version
│ 
│   on terraform.tf line 40, in terraform:
│   40:   required_version = "1.1.4"
│ 
│ This configuration does not support Terraform version 1.1.5. To proceed, either choose another supported Terraform version or update this version constraint. Version constraints are normally set for good reason, so updating the constraint may lead to other errors or unexpected
│ behavior.
```

```
$ ASDF_TERRAFORM_VERSION=1.1.5 terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.mx_1 will be created
  + resource "cloudflare_record" "mx_1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 5
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "MX"
      + value           = "route1.mx.cloudflare.net"
      + zone_id         = "0da42c8d2132a9ddaf714f9e7c920711"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

cloudflare_record.mx_1: Creating...
cloudflare_record.mx_1: Creation complete after 0s [id=318a0b16eea91338ef42a36ef8d51adc]
```

do you see this behaviour with terraform > 1.2 and the 4.x release of the provider?